{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-09-24T13:42:46.6716818Z","creationSource":null,"description":"","lastModifiedDateTime":"2024-11-29T12:46:53.5630638Z","name":"bl-win-cfg-defender-firewall","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":3,"technologies":"mdm,microsoftSense","id":"0697e093-c447-4376-ad8e-b2a4649fc3ec","templateReference":{"templateId":"6078910e-d808-4a9f-a51d-1b8a7bacb7c0_1","templateFamily":"endpointSecurityFirewall","templateDisplayName":"Windows Firewall","templateDisplayVersion":"Version 1"},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall","settingInstanceTemplateReference":{"settingInstanceTemplateId":"7714c373-a19a-4b64-ba6d-2e9db04a7684"},"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true","settingValueTemplateReference":{"settingValueTemplateId":"120c5dbe-0c88-46f0-b897-2c996d3e5277","useTemplateDefault":false},"children":[]}}},{"id":"1","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall","settingInstanceTemplateReference":{"settingInstanceTemplateId":"1c14f914-69bb-49f8-af5b-e29173a6ee95"},"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true","settingValueTemplateReference":{"settingValueTemplateId":"9d55dfae-d55f-4f2a-af03-9a9524f61e76","useTemplateDefault":false},"children":[]}}},{"id":"2","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall","settingInstanceTemplateReference":{"settingInstanceTemplateId":"e2714734-708e-4286-8ae9-d56821e306a3"},"choiceSettingValue":{"value":"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true","settingValueTemplateReference":{"settingValueTemplateId":"c38694c7-51a4-4a35-8f64-b10866a04776","useTemplateDefault":false},"children":[]}}}]}