{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-09-24T13:40:53.9650504Z","creationSource":null,"description":"","lastModifiedDateTime":"2024-11-29T13:06:15.1862911Z","name":"bl-win-cfg-drive-encryption","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":5,"technologies":"mdm","id":"1dabface-e002-4f6c-9cc5-416a1022fbb3","templateReference":{"templateId":"46ddfc50-d10f-4867-b852-9434254b3bff_1","templateFamily":"endpointSecurityDiskEncryption","templateDisplayName":"BitLocker","templateDisplayVersion":"Version 1"},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_requiredeviceencryption","settingInstanceTemplateReference":{"settingInstanceTemplateId":"20ec1f6e-0d7a-4b6f-9a4f-9ed33e69ce51"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_requiredeviceencryption_1","settingValueTemplateReference":{"settingValueTemplateId":"86da5fa5-67cf-48d1-8215-8787a9900ae6","useTemplateDefault":false},"children":[]}}},{"id":"1","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_allowwarningforotherdiskencryption","settingInstanceTemplateReference":{"settingInstanceTemplateId":"e40531ee-2225-406b-b07b-1c17186c088c"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_allowwarningforotherdiskencryption_0","settingValueTemplateReference":{"settingValueTemplateId":"7d348597-0f2a-43db-9fad-8b55c4f89bfe","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_allowstandarduserencryption","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_allowstandarduserencryption_1","settingValueTemplateReference":{"settingValueTemplateId":"7d348597-0f2a-43db-9fad-8b55c4f89bfe","useTemplateDefault":false},"children":[]}}]}}},{"id":"2","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_configurerecoverypasswordrotation","settingInstanceTemplateReference":{"settingInstanceTemplateId":"48c938a7-afa0-40ef-914f-40b5da5735b4"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_configurerecoverypasswordrotation_1","settingValueTemplateReference":{"settingValueTemplateId":"48278072-3b30-48e9-b654-ad683fdb9aae","useTemplateDefault":false},"children":[]}}},{"id":"3","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesencryptiontype","settingInstanceTemplateReference":{"settingInstanceTemplateId":"d3e31794-1ce6-4572-ab0c-0c0f9200a509"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesencryptiontype_1","settingValueTemplateReference":{"settingValueTemplateId":"54f346c7-008f-421c-bcb5-40f822bb97fe","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name_2","settingValueTemplateReference":{"settingValueTemplateId":"54f346c7-008f-421c-bcb5-40f822bb97fe","useTemplateDefault":false},"children":[]}}]}}},{"id":"4","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication","settingInstanceTemplateReference":{"settingInstanceTemplateId":"a5673a18-196d-49a0-a460-a8f35b807b45"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_1","settingValueTemplateReference":{"settingValueTemplateId":"f742e25d-2f09-41f7-9556-6af75960f42b","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmpinkeyusagedropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmpinkeyusagedropdown_name_2","settingValueTemplateReference":{"settingValueTemplateId":"f742e25d-2f09-41f7-9556-6af75960f42b","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmstartupkeyusagedropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmstartupkeyusagedropdown_name_2","settingValueTemplateReference":{"settingValueTemplateId":"f742e25d-2f09-41f7-9556-6af75960f42b","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurepinusagedropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurepinusagedropdown_name_2","settingValueTemplateReference":{"settingValueTemplateId":"f742e25d-2f09-41f7-9556-6af75960f42b","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmusagedropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmusagedropdown_name_2","settingValueTemplateReference":{"settingValueTemplateId":"f742e25d-2f09-41f7-9556-6af75960f42b","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurenontpmstartupkeyusage_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurenontpmstartupkeyusage_name_1","settingValueTemplateReference":{"settingValueTemplateId":"f742e25d-2f09-41f7-9556-6af75960f42b","useTemplateDefault":false},"children":[]}}]}}}]}