{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-02-01T11:38:32.7264151Z","creationSource":null,"description":"","lastModifiedDateTime":"2024-11-26T16:30:44.861809Z","name":"bl-win-cfg-application-control","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"f0476f22-a5a9-458c-9188-1d060da930c4","templateReference":{"templateId":"4321b946-b76b-4450-8afd-769c08b16ffc_1","templateFamily":"endpointSecurityApplicationControl","templateDisplayName":"App Control for Business","templateDisplayVersion":"Version 1"},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_applicationcontrol_policies_{policyguid}_policiesoptions","settingInstanceTemplateReference":{"settingInstanceTemplateId":"1de98212-6949-42dc-a89c-e0ff6e5da04b"},"choiceSettingValue":{"value":"device_vendor_msft_policy_config_applicationcontrol_built_in_controls_selected","settingValueTemplateReference":{"settingValueTemplateId":"b28c7dc4-c7b2-4ce2-8f51-6ebfd3ea69d3","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"device_vendor_msft_policy_config_applicationcontrol_built_in_controls","settingInstanceTemplateReference":null,"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_applicationcontrol_built_in_controls_enable_app_control","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_applicationcontrol_built_in_controls_enable_app_control_1","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionInstance","settingDefinitionId":"device_vendor_msft_policy_config_applicationcontrol_built_in_controls_trust_apps","settingInstanceTemplateReference":null,"choiceSettingCollectionValue":[{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_applicationcontrol_built_in_controls_trust_apps_0","children":[]},{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_applicationcontrol_built_in_controls_trust_apps_1","children":[]}]}]}]}]}}}]}