{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-01-31T07:17:35.5449376Z","creationSource":"Migration_DI_1ef36184-f2d3-4ba6-a643-5c3fd4adc96d","description":"","lastModifiedDateTime":"2024-11-29T12:47:11.6888321Z","name":"bl-win-cfg-defender-connector","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":3,"technologies":"mdm,microsoftSense","id":"6343b2c6-d721-4124-a032-29f4584703d3","templateReference":{"templateId":"0385b795-0f2f-44ac-8602-9f65bf6adede_1","templateFamily":"endpointSecurityEndpointDetectionAndResponse","templateDisplayName":"Endpoint detection and response","templateDisplayVersion":"Version 1"},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_windowsadvancedthreatprotection_configurationtype","settingInstanceTemplateReference":{"settingInstanceTemplateId":"23ab0ea3-1b12-429a-8ed0-7390cf699160"},"choiceSettingValue":{"value":"device_vendor_msft_windowsadvancedthreatprotection_configurationtype_autofromconnector","settingValueTemplateReference":{"settingValueTemplateId":"e5c7c98c-c854-4140-836e-bd22db59d651","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"device_vendor_msft_windowsadvancedthreatprotection_onboarding_fromconnector","settingInstanceTemplateReference":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSecretSettingValue","settingValueTemplateReference":null,"value":"d3d6162b-5f93-48c3-bc88-d54cabf26d75","valueState":"encryptedValueToken"}}]}}},{"id":"1","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_windowsadvancedthreatprotection_configuration_samplesharing","settingInstanceTemplateReference":{"settingInstanceTemplateId":"6998c81e-2814-4f5e-b492-a6159128a97b"},"choiceSettingValue":{"value":"device_vendor_msft_windowsadvancedthreatprotection_configuration_samplesharing_1","settingValueTemplateReference":{"settingValueTemplateId":"f72c326c-7c5b-4224-b890-0b9b54522bd9","useTemplateDefault":false},"children":[]}}},{"id":"2","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_windowsadvancedthreatprotection_configuration_telemetryreportingfrequency","settingInstanceTemplateReference":{"settingInstanceTemplateId":"03de6095-07c4-4f35-be38-c1cd3bae4484"},"choiceSettingValue":{"value":"device_vendor_msft_windowsadvancedthreatprotection_configuration_telemetryreportingfrequency_2","settingValueTemplateReference":{"settingValueTemplateId":"350b0bea-b67b-43d4-9a04-c796edb961fd","useTemplateDefault":false},"children":[]}}}]}