{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-04-30T11:28:09.1060517Z","creationSource":null,"description":"","lastModifiedDateTime":"2024-11-26T16:25:18.1749756Z","name":"bl-win-cfg-web-signin","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"1400d1b8-fe13-46b1-9063-45be70dedd0a","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_authentication_enablewebsignin","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_authentication_enablewebsignin_1","children":[]}}}]}