{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-10-03T13:50:45.2424134Z","creationSource":null,"description":"","lastModifiedDateTime":"2024-11-26T16:28:17.6990885Z","name":"bl-win-cfg-privilege-mgmt","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm,endpointPrivilegeManagement","id":"5e41c96b-bbe2-44f4-aa69-c482a96513b2","templateReference":{"templateId":"e7dcaba4-959b-46ed-88f0-16ba39b14fd8_1","templateFamily":"endpointSecurityEndpointPrivilegeManagement","templateDisplayName":"Elevation settings policy","templateDisplayVersion":"Version 1"},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_elevationclientsettings_enableepm","settingInstanceTemplateReference":{"settingInstanceTemplateId":"58a79a4b-ba9b-4923-a7a5-6dc1a9f638a4"},"choiceSettingValue":{"value":"device_vendor_msft_policy_elevationclientsettings_enableepm_1","settingValueTemplateReference":{"settingValueTemplateId":"a13cc55c-307a-4962-aaec-20b832bf75c7","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_elevationclientsettings_defaultelevationresponse","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_elevationclientsettings_defaultelevationresponse_1","children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionInstance","settingDefinitionId":"device_vendor_msft_policy_privilegemanagement_elevationclientsettings_defaultelevationresponse_validation","settingInstanceTemplateReference":null,"choiceSettingCollectionValue":[{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_privilegemanagement_elevationclientsettings_defaultelevationresponse_validation_0","children":[]},{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_privilegemanagement_elevationclientsettings_defaultelevationresponse_validation_1","children":[]}]}]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_elevationclientsettings_allowelevationdetection","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_elevationclientsettings_allowelevationdetection_1","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_elevationclientsettings_senddata","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_elevationclientsettings_senddata_0","children":[]}}]}}}]}